Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/hooks-faq_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: For example, side effects belong in `useEffect`, not `useMemo`.
ja: 例えば副作用は `useMemo` ではなく `useEffect` の仕事です。

source: **You may rely on `useMemo` as a performance optimization, not as a semantic guarantee.** In the future, React may choose to "forget" some previously memoized values and recalculate them on next render, e.g. to free memory for offscreen components.
ja: **`useMemo` はパフォーマンス最適化のために使うものであり、意味上の保証があるものだと考えないでください。**将来的に React は、例えば画面外のコンポーネント用のメモリを解放する、などの理由で、メモ化された値を「忘れる」ようにする可能性があります。

source: Write your code so that it still works without `useMemo` — and then add it to optimize performance.
ja: `useMemo` なしでも動作するコードを書き、パフォーマンス最適化のために `useMemo` を加えるようにしましょう

source: (For rare cases when a value must *never* be recomputed, you can [lazily initialize](#how-to-create-expensive-objects-lazily) a ref.)
ja: （値が*絶対に*再計算されてはいけないというような稀なケースでは、ref の[遅延初期化](#how-to-create-expensive-objects-lazily)を行うことができます）。

source: Conveniently, `useMemo` also lets you skip an expensive re-render of a child:
ja: 便利なことに、`useMemo` は子コンポーネントの計算量の高い再レンダーをスキップするのにも使えます：

source: Note that this approach won't work in a loop because Hook calls [can't](/docs/hooks-rules.html) be placed inside loops.
ja: フック呼び出しはループ内に[配置できない](/docs/hooks-rules.html)ため、このアプローチはループ内では動作しないことに注意してください。

source: But you can extract a separate component for the list item, and call `useMemo` there.
ja: ただしリストのアイテムの部分を別のコンポーネントに抽出してその中で `useMemo` を呼び出すことは可能です。

source: ### How to create expensive objects lazily?
ja: ### 計算量の大きいオブジェクトの作成を遅延する方法はありますか？

source: `useMemo` lets you [memoize an expensive calculation](#how-to-memoize-calculations) if the dependencies are the same.
ja: `useMemo` を使えば同じ値に依存している[高価な計算の結果をメモ化](#how-to-memoize-calculations)することができます。

source: However, it only serves as a hint, and doesn't *guarantee* the computation won't re-run.
ja: しかしこれはあくまでヒントとして使われるものであり、計算が再実行されないということを*保証*しません。

source: But sometimes you need to be sure an object is only created once.
ja: しかし時にはオブジェクトが一度しか作られないことを保証したい場合があります。

source: **The first common use case is when creating the initial state is expensive:**
ja: **まずよくあるユースケースは state の初期値を作成することが高価な場合です。**

source: To avoid re-creating the ignored initial state, we can pass a **function** to `useState`:
ja: 次回以降のレンダーでは無視される初期 state を毎回作成しなおすことを防ぐため、`useState` に**関数**を渡すことができます。

source: React will only call this function during the first render.
ja: React は初回レンダー時のみこの関数を呼び出します。

source: See the [`useState` API reference](/docs/hooks-reference.html#usestate).
ja: [`useState` の API リファレンス](/docs/hooks-reference.html#usestate)を参照してください。

source: **You might also occasionally want to avoid re-creating the `useRef()` initial value.** For example, maybe you want to ensure some imperative class instance only gets created once:
ja: また、**まれに `useRef()` の初期値を毎回再作成することを避けたいということもあります。**例えば、命令型で作成するクラスのインスタンスが一度しか作成されないことを保証したいということがあるかもしれません。

source: `useRef` **does not** accept a special function overload like `useState`.
ja: `useRef` は `useState` のような関数を渡す形式のオーバーロード記法が**使えません**。

source: Instead, you can write your own function that creates and sets it lazily:
ja: 代わりに、自分で関数を書いて高価なオブジェクトを遅延型で ref に設定することが可能です。

source: This avoids creating an expensive object until it's truly needed for the first time.
ja: これにより、本当に必要になるまで高価なオブジェクトの作成を避けることができます。

source: If you use Flow or TypeScript, you can also give `getObserver()` a non-nullable type for convenience.
ja: Flow や TypeScript を使っているなら、`getObserver()` を non-nullable な型にしておくと便利でしょう。

source: ### Are Hooks slow because of creating functions in render?
ja: ### レンダー内で関数を作るせいでフックは遅くなるのではないですか？

source: In modern browsers, the raw performance of closures compared to classes doesn't differ significantly except in extreme scenarios.
ja: モダンブラウザでは、特殊な場合を除いて、クラスと比較してクロージャーの生の性能はそれほど変わりません。

source: In addition, consider that the design of Hooks is more efficient in a couple ways:
ja: しかも、フックの設計は幾つかの点においてはより効率的です。

source: * Hooks avoid a lot of the overhead that classes require, like the cost of creating class instances and binding event handlers in the constructor.
ja: * フックを使えば、クラスインスタンスの作成や、コンストラクタでのイベントハンドラのバインドといった、クラスの場合に必要な様々なオーバーヘッドを回避できます。

source: * **Idiomatic code using Hooks doesn't need the deep component tree nesting** that is prevalent in codebases that use higher-order components, render props, and context.
ja: * フックをうまく用いたコードは、高階コンポーネントやレンダープロップやコンテクストを多用するコードベースで見られるような**深いコンポーネントのネストを必要としません**。

source: With smaller component trees, React has less work to do.
ja: コンポーネントツリーが小さければ、React がやるべき仕事も減ります。

source: Traditionally, performance concerns around inline functions in React have been related to how passing new callbacks on each render breaks `shouldComponentUpdate` optimizations in child components.
ja: 過去には、インライン関数によるパフォーマンスの懸念というのは、レンダー毎に新しいコールバック関数を作って渡すと子コンポーネントでの `shouldComponentUpdate` による最適化が動かなくなる、という問題と関連していました。

source: Hooks approach this problem from three sides.
ja: フックではこの問題について 3 つの側面から対応します。

source: * The [`useCallback`](/docs/hooks-reference.html#usecallback) Hook lets you keep the same callback reference between re-renders so that `shouldComponentUpdate` continues to work:
ja: * [`useCallback`](/docs/hooks-reference.html#usecallback) フックを使えば再レンダーをまたいで同じコールバックを保持できるので、`shouldComponentUpdate` がうまく動作し続けます

source: * The [`useMemo`](/docs/hooks-faq.html#how-to-memoize-calculations) Hook makes it easier to control when individual children update, reducing the need for pure components.
ja: * [`useMemo`](/docs/hooks-faq.html#how-to-memoize-calculations) フックを使うことで個々の子コンポーネントをいつ更新するのかを制御しやすくなるため、コンポーネントが純粋である必要性は低くなっています

source: * Finally, the [`useReducer`](/docs/hooks-reference.html#usereducer) Hook reduces the need to pass callbacks deeply, as explained below.
ja: * 最後に、以下で説明されているように、[`useReducer`](/docs/hooks-reference.html#usereducer) フックを使えば、複数のコールバックを深い階層に受け渡していく必要があまりなくなります

source: ### How to avoid passing callbacks down?
ja: ### どうすれば複数のコールバックを深く受け渡すのを回避できますか？

source: We've found that most people don't enjoy manually passing callbacks through every level of a component tree.
ja: 我々が見たところ、ほとんどの人はコンポーネントツリーの各階層で手作業でコールバックを受け渡ししていく作業が好きではありません。

source: Even though it is more explicit, it can feel like a lot of "plumbing".
ja: それはより明示的ではありますが、面倒な『配管工事』をしている気分になることがあります。

source: In large component trees, an alternative we recommend is to pass down a `dispatch` function from [`useReducer`](/docs/hooks-reference.html#usereducer) via context:
ja: 大きなコンポーネントツリーにおいて我々がお勧めする代替手段は、[`useReducer`](/docs/hooks-reference.html#usereducer) で `dispatch` 関数を作って、それをコンテクスト経由で下の階層に渡す、というものです。

source: Any child in the tree inside `TodosApp` can use the `dispatch` function to pass actions up to `TodosApp`:
ja: `TodosApp` ツリーの中にいるあらゆる子コンポーネントはこの `dispatch` 関数を使うことができ、上位にいる `TodosApp` にアクションを伝えることができます。

source: This is both more convenient from the maintenance perspective (no need to keep forwarding callbacks), and avoids the callback problem altogether.
ja: これは（複数のコールバックを何度も受け渡しする必要がないので）メンテナンスの観点から便利だ、というだけではなく、コールバックにまつわる問題をすべて回避できます。

source: Passing `dispatch` down like this is the recommended pattern for deep updates.
ja: 深い更新においてはこのように `dispatch` を渡すのがお勧めのパターンです。

source: Note that you can still choose whether to pass the application *state* down as props (more explicit) or as context (more convenient for very deep updates).
ja: アプリケーションの **state** については、props として渡していくか（より明示的）、あるいはコンテクスト経由で渡すか（深い更新ではより便利）を選ぶ余地が依然あります。

source: If you use context to pass down the state too, use two different context types -- the `dispatch` context never changes, so components that read it don't need to rerender unless they also need the application state.
ja: もしもコンテクストを使って state も渡すことにする場合は、2 つの別のコンテクストのタイプを使ってください -- `dispatch` のコンテクストは決して変わらないため、`dispatch` だけを使うコンポーネントは（アプリケーションの state も必要でない限り）再レンダーする必要がなくなります。

source: ### How to read an often-changing value from `useCallback`?
ja: ### `useCallback` からの頻繁に変わる値を読み出す方法は？

source: >Note > >We recommend to [pass `dispatch` down in context](#how-to-avoid-passing-callbacks-down) rather than individual callbacks in props.
ja: > 補足 > > 我々は個別のコールバックを props として渡すのではなく、[コンテクスト経由で `dispatch` を渡す](#how-to-avoid-passing-callbacks-down)ことを推奨しています。

source: The approach below is only mentioned here for completeness and as an escape hatch.
ja: 以下のアプローチは網羅性と避難ハッチの目的で掲載しているものです。

source: > >Also note that this pattern might cause problems in the [concurrent mode](/blog/2018/03/27/update-on-async-rendering.html).
ja: > > また、[concurrent mode](/blog/2018/03/27/update-on-async-rendering.html) においてこのパターンは問題を起こす可能性があることにも注意してください。

source: We plan to provide more ergonomic alternatives in the future, but the safest solution right now is to always invalidate the callback if some value it depends on changes.
ja: 将来的にはより使いやすい代替手段を提供することを計画していますが、現時点での最も安全な解決法は、コールバックが依存している何らかの値が変わった場合はコールバックを無効化して作り直すことです。

source: In some rare cases you might need to memoize a callback with [`useCallback`](/docs/hooks-reference.html#usecallback) but the memoization doesn't work very well because the inner function has to be re-created too often.
ja: 稀なケースですが、コールバックを [`useCallback`](/docs/hooks-reference.html#usecallback) でメモ化しているにも関わらず、内部関数を何度も再作成しないといけないためメモ化がうまく働かない、ということがあります。

source: If the function you're memoizing is an event handler and isn't used during rendering, you can use [ref as an instance variable](#is-there-something-like-instance-variables), and save the last committed value into it manually:
ja: あなたがメモ化しようとしている関数がレンダー最中には使われないイベントハンドラなのであれば、[インスタンス変数としての ref](#is-there-something-like-instance-variables) を使って最後に使われた値を手動で保持しておくことができます。

source: This is a rather convoluted pattern but it shows that you can do this escape hatch optimization if you need it.
ja: これはやや複雑なパターンですが、このような避難ハッチ的最適化は必要であれば可能だということです。

source: It's more bearable if you extract it to a custom Hook:
ja: カスタムフックに抽出すれば多少は読みやすくなります：

source: In either case, we **don't recommend this pattern** and only show it here for completeness.
ja: いずれにせよ、**このパターンは薦められず**、網羅性のために示しているに過ぎません。

source: Instead, it is preferable to [avoid passing callbacks deep down](#how-to-avoid-passing-callbacks-down).
ja: 代わりに[コールバックを深く受け渡していくことを回避する](#how-to-avoid-passing-callbacks-down)のが望ましいパターンです。

source: ## Under the Hood {#under-the-hood}
ja: ## 内部の仕組み {#under-the-hood}

source: ### How does React associate Hook calls with components?
ja: ### React はフック呼び出しとコンポーネントとをどのように関連付けているのですか？

source: React keeps track of the currently rendering component.
ja: React は現在どのコンポーネントがレンダー中なのかを把握しています。

source: Thanks to the [Rules of Hooks](/docs/hooks-rules.html), we know that Hooks are only called from React components (or custom Hooks -- which are also only called from React components).
ja: [フックのルール](/docs/hooks-rules.html)のお陰で、フックは React のコンポーネント内（あるいはそれらから呼び出されるカスタムフック内）でのみ呼び出されるということが分かっています。

source: There is an internal list of "memory cells" associated with each component.
ja: それぞれのコンポーネントに関連付けられる形で、React 内に「メモリーセル」のリストが存在しています。

source: They're just JavaScript objects where we can put some data.
ja: それらは単に何らかのデータを保存できる JavaScript のオブジェクトです。

source: When you call a Hook like `useState()`, it reads the current cell (or initializes it during the first render), and then moves the pointer to the next one.
ja: あなたが `useState()` のようなフックを呼ぶと、フックは現在のセルの値を読み出し（あるいは初回レンダー時はセル内容を初期化し）、ポインタを次に進めます。

source: This is how multiple `useState()` calls each get independent local state.
ja: これが複数の `useState()` の呼び出しが個別のローカル state を得る仕組みです。

source: ### What is the prior art for Hooks?
ja: ### フックの先行技術にはどのようなものがありますか？

source: Hooks synthesize ideas from several different sources:
ja: フックは複数の異なった出典からのアイディアを総合したものです：

source: * Our old experiments with functional APIs in the [react-future](https://github.com/reactjs/react-future/tree/master/07%20-%20Returning%20State) repository.
ja: * [react-future](https://github.com/reactjs/react-future/tree/master/07%20-%20Returning%20State) リポジトリにおける関数型 API の古い実験。

source: * React community's experiments with render prop APIs, including [Ryan Florence](https://github.com/ryanflorence)'s [Reactions Component](https://github.com/reactions/component).
ja: * [Ryan Florence](https://github.com/ryanflorence) の [Reactions Component](https://github.com/reactions/component) を含む、React コミュニティのレンダープロップ API に関する実験。

source: * [Dominic Gannaway](https://github.com/trueadm)'s [`adopt` keyword](https://gist.github.com/trueadm/17beb64288e30192f3aa29cad0218067) proposal as a sugar syntax for render props.
ja: * [Dominic Gannaway](https://github.com/trueadm) によって提案された、レンダープロップの糖衣構文としての [`adopt` keyword](https://gist.github.com/trueadm/17beb64288e30192f3aa29cad0218067)。

source: * State variables and state cells in [DisplayScript](http://displayscript.org/introduction.html).
ja: * [DisplayScript](http://displayscript.org/introduction.html) のステート変数とステートセル。

source: * [Reducer components](https://reasonml.github.io/reason-react/docs/en/state-actions-reducer.html) in ReasonReact.
ja: * ReasonReact の [Reducer components](https://reasonml.github.io/reason-react/docs/en/state-actions-reducer.html)。

source: * [Subscriptions](http://reactivex.io/rxjs/class/es6/Subscription.js~Subscription.html) in Rx.
ja: * Rx の [Subscriptions](http://reactivex.io/rxjs/class/es6/Subscription.js~Subscription.html)。

source: * [Algebraic effects](https://github.com/ocamllabs/ocaml-effects-tutorial#2-effectful-computations-in-a-pure-setting) in Multicore OCaml.
ja: * Multicore OCaml の [Algebraic effects](https://github.com/ocamllabs/ocaml-effects-tutorial#2-effectful-computations-in-a-pure-setting)。

source: [Sebastian Markbåge](https://github.com/sebmarkbage) came up with the original design for Hooks, later refined by [Andrew Clark](https://github.com/acdlite), [Sophie Alpert](https://github.com/sophiebits), [Dominic Gannaway](https://github.com/trueadm), and other members of the React team.
ja: フックは [Sebastian Markbåge](https://github.com/sebmarkbage) が最初のデザインを作り、[Andrew Clark](https://github.com/acdlite)、[Sophie Alpert](https://github.com/sophiebits)、[Dominic Gannaway](https://github.com/trueadm) およびその他の React チームのメンバーが洗練させました。
